package bg.tu_varna.sit.task9;

/**
 * Задача 9
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете
 * сорс файловете в пакет bg.tu_varna.sit.task9
 * <p>
 * Да се реализира клас Car, който се определя от марка (brand),
 * модел (model), цвят (color) (16-но число), мощност (power), тип
 * двигател (engineType), тип скоростна кутия (transmission), година
 * на производство (yearOfManufacture), изминати километри (mileage).
 * <p>
 * Когато се създава кола тя е без изминати километри и цвета и е (CCCCCC).
 * Класа дефинира метод за стартиране на двигател (startup), който връща
 * истина двигателя може да се стартира винаги.
 * <p>
 * Класа Car се наследява от клас Truck, който го разширява с товарен
 * капацитет (capacity) и изминато време от стартирането на двигателя
 * (elapsedTime). Метода за стартиране на двигател (startup), връща истина
 * ако двигателя може да се стартира, когато изминатото време от стартирането
 * на двигателя е по-малко от 6 часа или лъжа, като изминатото време е повече от 6 часа.
 * <p>
 * Класа Car се наследява от клас Bus, който го разширява с брой пътнически
 * места (seats) и изминати курсове (courses). Двигателя може да се стартира
 * с метода за стартиране на свигател (startup), ако не е превишен лимита на
 * курсовете. Средния брой курсове на ден са 10, ако остатъка от разликата на
 * изминатите курсове и максималния брой на ден е по-малко от 5 се връща, че не
 * е превишен лимита (false), ако е повече от 5, че е превишен лимита (true).
 */
class Application {

  public static void main(String[] args) {

  }
}
