#include <iostream>
using namespace std;

/*
Задача 3
Съставете програма, в която да се въвеждат две реални числа за страните на правоъгълник
и да се извеждат обиколката и лицето му.
*/

int main()
{
	// Деклариране на променливи за страните на правоъгълника
	double width, length;
	cin >> width >> length;

	// Пресмятане на обиколката на правоъгълника и запазване в променлива
	double perimeter = 2 * (width + length);

	// Пресмятане на лицето на правоъгълника и запазване в променлива
	double area = width * length;

	// Отпечатване обиколката и лицето на правоъгълника
	cout << "Perimeter: " << perimeter << endl << "Area: " << area;
}
