package bg.tu_varna.sit.task5;

/**
 * Задача 5
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете
 * сорс файловете в пакет bg.tu_varna.sit.task5
 * <p>
 * Да се реализира клас Фирма (Company), определящ се от: Име на фирмата
 * (name), единен идентификационен код (EIK) – уникален 9-цифрен код,
 * приходи за текущата година от дейността (incomes), разходи за текущата
 * година от дейността (costs), методи за извличане стойностите на полетата.
 * Да се създаде абстрактен метод , който връща като резултат дължимия данък
 * върху печалбата от фирмата.
 * <p>
 * Класът Фирма да се наследява от:
 * • Фирма ООД (CompanyLtd), който я разширява с размера на капитала
 * на фирмата (capital) и финансов резултат от предходна година (profit).
 * Дължимият данък при тази правна форма се изчислява в следната последователност:
 * 1. Изчислява се оперативната печалба, като от приходите от дейността се
 * извадят разходите за дейността. Ако полученото число е отрицателно, данък не се дължи.
 * 2. Ако финансовият резултат от предходната година е отрицателен, той се
 * приспада от оперативната печалба. Ако полученото число е отрицателно, данък не се дължи.
 * 3. Ако полученият резултат е положителен, данъкът се изчислява като 10% от стойността му.
 * <p>
 * • Фирма ЕТ (CompanyST), който разширява Фирма с име на собственика (owner)
 * и поле, което указва дали упражняваната от него дейност е патентна или не (isPatentActivity).
 * Дължимият данък при ЕТ в следната последователност:
 * 1. Ако ЕТ упражнява патентна дейност, данъкът е фиксиран за цялата година и е в размер на 500 лв.
 * 2. Ако дейността не е патентна, данъкът е на стойност 15% от оперативната печалба, ако той е положителен.
 */
class Application {

  public static void main(String[] args) {

  }
}
