package bg.tu_varna.sit.task10;

/**
 * Задача 10
 * <p>
 * Да се реализират класове, описващи окръжност (Circle), конус
 * (cone) и цилиндър (cylinder). Всеки един от класовете да съдържа
 * по два конструктора – един с параметри и един по подразбиране,
 * които инициализират стойностите на полетата. Дефинирайте интерфейси
 * за изчисление лицето на фигурите (Аrea) с метод (calculate) и обема
 * им (Volume) с метод (calculate). Общите свойства на фигурите да се
 * изведат в общ родителски клас (Shape), от който да не могат да се създават обекти.
 */
class Application {

  public static void main(String[] args) {

  }
}
