#include <iostream>
using namespace std;

/*
* Задача 7
* Съставете програма, която да изчисли x = (2y + 5) / (14 - y / 3) при предварително инициализирана стойност на y.
*/

int main()
{
	// Въвеждане на стойност за y
	double y;
	cin >> y;

	// Деклариране на променлива x и пресмятане на резултата
	double x = (2 * y + 5) / (14 - y / 3);

	// Извеждане на резултата x
	cout << x;
}