#include <iostream>
using namespace std;

/*
* Задача 8
* Съставете програма, която да намира дължината на хипотенузата в правоъгълен триъгълник
* на базата на въведени от клавиатурата катети–естествени числа.
* Припомняме, че тя се намира по формулата 𝑐=√𝑎2+𝑏2.
*/

int main()
{
	// Въвеждане на стойности за катетите
	double a, b;
	cin >> a >> b;

	// Пресмятане на хипотенузата
	double c = sqrt(pow(a, 2) + pow(b, 2));

	// Извеждане на хипотенузата
	cout << c;
}