package tuvarna.exercise09;

/**
 * Задача 9
 * <p>
 * Да се реализира клас Car, който се определя от марка, модел, цвят (16-но число),
 * мощност, тип двигател, тип скоростна кутия, година на производство, изминати километри.
 * Методи за извличане стойностите на полетата и методи за модификация стойностите на
 * полетата цвят и изминати километри. Създайте конструктор по всички полета
 * (без изминатите километри) и конструктор без полето цвят (без изминатите километри).
 * Класа Car се наследява от клас Truck, който го разширява с товарен капацитет и
 * изминато време от стартирането на двигателя. Методи за извличане стойностите на
 * полетата и модификация за изминато време от стартирането на двигателя. Метод,
 * който да връща истина ако двигателя може да се стартира когато изминатото време
 * от стартирането на двигателя е по-малко от 6 часа или лъжа, като изминатото време е повече от 6 часа.
 * Класа Car се наследява от клас Bus, който го разширява с брой пътнически места
 * и изминати курсове. Методи за извличане стойностите на полетата. Метод за увеличаване на
 * изминатите курсове. Метод, който да проверява дали e превишен лимита на курсовете.
 * Средния брой курсове на ден са 10, ако остатъка от разликата на изминатите курсове и максималния
 * брой на ден е по-малко от 5 се връща, че не е превишен лимита (false), ако е повече от 5, че е превишен лимита (true).
 * Подберете подходящи модификатори за достъп при всеки клас.
 */
public class Main {

  public static void main(String[] args) {

    Bus bus = new Bus(
            "Mercedes", "M", 1200, "Benzine",
            "Manual", 2000, 7, 10);
    bus.increaseCourses();
    System.out.println(bus.isCourseLimitExceeded());

    Truck truck = new Truck(
            "Volvo", "M", "White", 1200, "Benzine",
            "Manual", 2000, 7, 15);
    truck.canStartEngine();
  }
}
