#include <iostream>
#include <graphics.h>

using namespace std;

int main()
{

  double a[] = {5, 12, 18, 8, 13, 23, 14, 10};
  char labels[][20] = {"a", "b", "c", "d", "e", "f", "g", "h"};
  int n = sizeof(a)/sizeof(a[0]);

  int winwidth = 800, winheight = 600;
  int pX = 600, pY = 500, d = 50, dS = 30, dC = 30, x0 = 100, y0 = 550;

  int i, x1, y1, x2, y2;


  // намиране на диапазона на изменение на данните
  double aMin = a[0];
  double aMax = a[0];
  for (int i = 1; i < n; i++) {
    if (a[i] > aMax) aMax = a[i];
    if (a[i] < aMin) aMin = a[i];
  }

  // всички стойност са положителни, разширяваме диапазона до amin=0, за да
  //може най-малкото стълбче да се види като стълбче, а не като отсечка върху скалата с надписите
  if (aMin > 0) aMin = 0;
  // всички стойност са отрицателни, разширяваме диапазона до amax=0, за да
  //може най-малкото стълбче да се види като стълбче, а не като отсечка върху оста с надписите
  if (aMax < 0) aMax = 0;

  //определяне на скалния коефициент за скалата със стойностите (хоризонталната)
  double s = (aMax - aMin) / pX;

  // определяне на новото положение на хоризонталната ос,за да може да се изобразяват само
  //положителни, само отрицателни или смесени данни
  int x0n = x0 - aMin / s;

  // инициализация на графичната система чрез отваряне на графичен прозорец със зададен размер
  initwindow(winwidth,winheight);


  //изчертаване на графичния прозорец
  line(x0,y0,x0+pX,y0);//хоризонтална ос
  line(x0n,y0,x0n,y0-pY);//вертикална ос

  int I = pX / d; // брой деления по скалата със стойностите

  char text[10];
  //изчертаване и надписване на деленията по оста със стойностите
  for(i=0; i<=I; i++)
  {
    //изчертаване на деленията
    line(x0+i*d, y0, x0+i*d, y0+3);
    //преобразуване на реалната стойност, съответстваща на делението в символен низ
    gcvt(aMin + i*d*s,3.2, text);
    settextjustify(1,2);
    // извеждане на стойността, съответстваща на делението
    outtextxy(x0+i*d,y0+5, text);
  }

  //надписване на оста с надписите
  for(i=1; i<=n; i++)
  {
    settextjustify(2,2);
    // извеждане на надписите, съответстващи на данните
    outtextxy(x0-10,y0-i*(dS + dC),labels[i-1]);
  }

  // изобразяване на стълбчетата, съответстващи на данните
  for(i=1; i<n+1; i++)
  {
    x1=x0n; // x координата на горен ляв ъгъл
    y1=y0-i*(dS + dC); //y координата на горен ляв ъгъл
    x2=x0n+a[i-1]/s; // x координата на долен десен ъгъл
    y2=y0-i*(dS + dC)+dS; // y координата на долен десен ъгъл
    setfillstyle(1, i+1);
    bar(x1,y1,x2,y2);
  }

  getch();
  return 0;
}
