package bg.tu_varna.sit.task1;

/**
 * Задача 1
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете
 * сорс файловете в пакет bg.tu_varna.sit.task1.
 * Създайте приложение за нуждите на натуропатичен медицински кабинет,
 * в който се предлага натурална добавка за укрепване на съпротивителните
 * сили на организма. В него се обслужват възрастни и деца над 3 години,
 * но има идея да се развие и в насока на някои домашни любимци.
 * Създайте клас, описващ дете (Child) с данни за име (name), възраст
 * (age) и телесно тегло (weight). При създаването на обект от класа,
 * ако посочената възраст е под 3 г., да се хвърля изключение InvalidAgeException.
 * Текстовото представяне на обекта да бъде във формат:
 * Име: <име на детето>, Възраст: <възраст на детето>
 * Създайте клас, описващ възрастен (Adult) с данни за име (name) и номер
 * на здравната осигуровка (assuranceNumber). Текстовото представяне на обекта да бъде във формат:
 * Име: <име>, Номер на здравна осигуровка: <номер>
 * Предвидете клас за медицински преглед (Medical), който да бъде описан
 * от параметризиран пациент (patient) и общо състояние на пациента (condition),
 * като изборът (Condition) е между възможностите good, stable и damaged.
 * Като поведение предвидете методи за:
 * - Изчисляване на подходяща дозировка в милилитри на хранителната добавка
 * (calculatePotion). Ако пациентът е дете, се предвиждат 0.250 мл. на всеки
 * килограм телесно тегло, като резултатът се закръгля до цяло число. При
 * останалите пациенти дневната дозировка е 25 мл. Ако състоянието на
 * пациента е увредено, тя се удвоява. Методът връща предписаното количество.
 * - Издаване на рецепта (getPrescription). Извежда като текст данните на
 * пациента от текстовото му представяне и предписаното количество от хранителната добавка във формат:
 * Пациент:
 * <данни на пациента>
 * Дозировка: <посочва се> мл.
 * • Издаване на купон за следващ преглед (getCoupon), който дава възможност
 * за 25% отстъпка. Методът връща като текст „Издаден купон на: <посочва се>”,
 * където може да бъде зададено име, номер на съществуващ пациент от регистъра на
 * кабинета (цяло петцифрено число) или да бъде оставен неименуван,
 * като за целта като параметър се подаде символа „-“.
 * Дефинирайте клас Application с главна функция и тествайте описаните функционалности.
 */
public class Application {

  public static void main(String[] args) {

    Adult adult = new Adult("Adult", "12345");

    Medical<Adult> medical = new Medical<>(adult, Condition.damaged);

    System.out.println(medical.calculatePotion());
    medical.getCoupon("12345");
    System.out.println();
    medical.getPrescription();

  }
}
