#include <iostream>
using namespace std;

/*
Задача 3
Съставете програма,в която да се декларират две целочислени променливи А и B.
Инициализирайте ги с желани от Вас стойности.
а) На променлива С с плаваща запетая присвоете резултата от делението на А и В. Изведете резултата.
б) На променлива D с плаваща запетая присвоете резултата от делението на А и В, като конвертирате А във float. Изведете резултата.
в) Като коментар в програмата обяснете резултатите от а) и б).
*/

int main()
{
	// Деклариране на две целочислени променливи А и B
	int a = 42;
	int b = 24;

	// Присвояване и извеждане на резултата от делението на А и В
	double c = a / b;
	cout << "a / b = " << c << endl;

	// Присвояване и извеждане на резултата от делението на А и В, като А е конвертирано към float
	double d = (float)a / b;
	cout << "a / b = " << d << " (A is converted to float)";

	/**
	* Изводът от горните примери е, че когато делим две целочислени числа, резултатът е целочислено число.
	* При деление на дробно число с целочислено число, резултатът от делението е дробно число.
	*/
}