#include <math.h>

#include <graphics.h>

#include <iostream>

using namespace std;
int main() {
  //кръгова диаграма

  double a[] = {
    73,
    56,
    37,
    90,
    18
  }, A = 0, max;
  int n = sizeof(a) / sizeof(a[0]);
  int winwidth = 800, winheight = 600; // параметри на прозореца на графичната система
  int x0 = 320, y0 = 280, rx = 150, ry = 100; //координати на центъра и радиуси на елипсата
  int xi, yi, i, j;
  double na4, krai, gama;
  char text[10];
  //намиране на сумата от данните
  for (i = 0; i < n; i++)
    A += a[i];
  //намиране на максималния елемент
  max = a[0];
  for (i = 0; i < n; i++)
    if (a[i] > max) max = a[i];
  // инициализация на графичната система чрез отваряне на графичен прозорец със зададен размер
  initwindow(winwidth, winheight);
  na4 = 0; //начален ъгъл в градуси за първия сектор от елипсата
  for (i = 0; i < n; i++) {
    gama = a[i] / A * 360; //определяне на ъгъла на сектора от елипсата,съответстващ на данните
    krai = na4 + gama; //определяне на края на сектора в градуси
    setcolor(i + 9);
    setfillstyle(2 + i, i + 1);
    //изнасяне на максималния елемент извън центъра на елипсата по ъглополовящата с малък
    //радиус

    xi = x0 + 0.2 * rx * cos((na4 + gama / 2.0) / 360.0 * 2 * M_PI);
    yi = y0 - 0.2 * ry * sin((na4 + gama / 2.0) / 360.0 * 2 * M_PI);
    if (a[i] == max)
      sector(xi, yi, na4, krai, rx, ry); //изчертаване на най-големия сектор,изнесен по

    //ъглополовящата
    else
      sector(x0, y0, na4, krai, rx, ry); //изчертаване на текущия сектор от елипсата
    //определяне на мястото на надписа, изнесен извън сектора по ъглополовящата на

    //текущия ъгъл
    xi = x0 + 1.2 * rx * cos((na4 + gama / 2.0) / 360.0 * 2 * M_PI);
    yi = y0 - 1.2 * ry * sin((na4 + gama / 2.0) / 360.0 * 2 * M_PI);
    setcolor(WHITE);
    gcvt(a[i], 5, text);
    outtextxy(xi, yi, text); //извеждане на стойността
    na4 = krai; //начален ъгъл за следващия сектор
  }
  getch();

  return 0;
}
