package bg.tu_varna.sit.task3;

/**
 * Задача 3
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете сорс файловете в пакет bg.tu_varna.sit.task3
 * Да се създаде програма за магазин. За целта са необходими:
 * - Интерфейс Delivery, който дефинира поведение дали дадената стока се нуждае от доставка needsDelivery(), който указва;
 * - Интерфейс Food, указващ дали дадената стока е хранителна, разширява интерфейса Delivery;
 * - Интерфейс Drink, указващ дали дадената стока е напитка, разширява интерфейса Delivery;
 * - Абстрактен клас Item, описващ се с име (name), срок на годност в дни (daysToExpire) и налично количество (availableQuantity). Класа имплементира Delivery.
 * - Клас Bread, наследяващ Item и го допълва с съдържание на бяло брашно (whiteFlourPercentage). Имплементиращ Food.
 * Има необходимост за доставка ако срокът за годност е по-малък от 5 дни и хлябът е със съдържание на бяло брашно над 75 или са останали по-малко от 10 бройки;
 * - Клас Cheese, наследяващ Item и го разширява с грамаж на опаковката (gramsPerPackage), имплементира Food.
 * Има необходимост от доставка ако са останали по-малко от 10 бройки сирене в опаковки до 400 грама;
 * - Клас Milk, наследяващ Item и го разширява с указващ процента масленост (fatPercentage).
 * Има необходимост от доставка ако млякото е трайност до 15 дни, останали са по-малко от 10 броя и маслеността е по-голяма от 2%;
 * - Клас Water, наследяващ Item и го разширява с обща минерализация (mineralContent),
 * Има необходимост от доставка ако са останали по-малко от 30 броя или ако срокът на годност изтича след по-малко от 20 дни.
 * Създайте клас Shop, който се описва с масив от стоки (items), Поведението на класа е:
 * - getItemCountDelivery(), изчислява и връща броя стоки, които се нуждаят от доставка;
 * - getAverageDaysToExpire(), изчислява и връща средния срок на годност за стоките в магазина;
 * - getAvailableDrinksCount(), който намира и връща колко са наличните напитки в магазина.
 */
public class Application {

  public static void main(String[] args) {

  }
}
