package bg.tu_varna.sit.task1;

/**
 * Задача 1
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете сорс
 * файловете в пакет bg.tu_varna.sit.task1
 * <p>
 * Да се реализира клас Град (City), описващ име (name) и пощенски
 * код (postalCode) (положително цяло число).
 * <p>
 * Да се реализира клас Лична карта (IdentificationCard), описващ номер (number),
 * Година на издаване (year), ЕГН (egn), Град на издаване (city). Като предоставя поведение
 * за, издадена от (publishedBy), връща: МВР Името на града на издаване и валидна
 * до (validUntil), връща: Година на издаване + 10 години
 * <p>
 * Да се реализира клас Person, описващ лични данни: Първо (firstName), Второ (secondName)
 * и Трето (thirdName) име. Имплементира метода toString извеждащ имената във формат:
 * Трето, Първо Второ, и методи за четене и запис на полетата.
 * <p>
 * Да се реализира клас Аdult, разширяващ класа Person с Лична карта (IdentificationCard).
 * Имплементира метода toString връщащ информацията във форма:
 * Трето, Първо Второ
 * Лична карта номер:
 * Издадена от:
 * Подберете подходящи модификатори за достъп при всеки клас.
 */
class Application {

  public static void main(String[] args) {

  }
}
