package bg.tu_varna.sit.task5;

/**
 * Задача 5
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете сорс
 * файловете в пакет bg.tu_varna.sit.task5
 * Съставете програма, с която да управлявате наличностите от напитки в бар.
 * Създайте интерфейс Delivery, който да съдържа два метода:
 * • needOfDelivery(), с който да се установява има ли (true) или няма (false)
 * нужда от доставка от дадена напитка;
 * • deliver(), с помощта на който да се доставят нови количества от съответната
 * напитка. Приема като параметър доставените количества.
 * Добавете втори интерфейс Serving, който съдържа метод serve() за сервиране на
 * единица от съответната напитка. Приема като параметър броя единици, поръчани от
 * съответната напитка. Например при поръчка на 5 чаши натурален сок, броят на единиците е 5.
 * Създайте клас Drink, който имплементира двата интерфейса. Всяка напитка има
 * наименование (name); налично количество, литра (quantity) и обем на една единица
 * за сервиране, литра (serveQuantity). Включва имплементацията на методите:
 * • deliver() – увеличава наличните количества с подадените като параметър доставени количества;
 * • serve() - при подадени като параметър единици за сервиране извършва проверка
 * дали има достатъчна наличност от напитката. Ако да, те се сервират директно на
 * клиентите. Ако не, се извършва проверка колко единици са налични и само те се сервират.
 * (сервирането става като се извадят сервираните количества от общото количество)
 * В текстовото представяне на напитките включете тяхното наименование, налични
 * количества и необходимост от доставка на нови количества.
 * Drink се разширява от класове:
 * • безалкохолна напитка (SoftDrink), която допълва информацията за напитката с
 * това дали е без захар (isSugarFree) и какъв е нейният вкус (drinkFragrance).
 * Вкусът ѝ се избира от предварително изготвен списък с константи (Fragrances),
 * който включва възможностите lemon, orange, kiwi, peach, apricot, pear, cola, none.
 * • алкохолна напитка (AlcoholicBeverage), която допълнително описва и обемния
 * процент на съдържащия се в нея алкохол (vol). Да включва булев метод (isProper),
 * с чиято помощ да се определя дали дадената напитка е препоръчителна за дадена
 * възрастова категория. Методът да приема като параметър възрастта на съответното
 * лице. Ако възрастта е в диапазона [18;21) години или над 70 г., препоръчителни
 * са само напитките с обемен процент под 10. Между 21 и 70 г. могат да се консумират
 * всички напитки. При въведена възраст в диапазона (0;18] да се хвърли изключение
 * „Лица под 18 г. не могат да консумират алкохолни напитки“, а при стойност по-малка
 * от 0 - „Въведена е невалидна възраст“. За нуждите на изключенията създайте
 * клас AlcoholicBeverageException, наследяващ Exception.
 * Минималното количество от дадена безалкохолна напитка, които барът се стреми
 * да поддържа, е 10 литра, а от алкохолна – 5 литра. Под тези наличности е необходима доставка.
 */
public class Application {

  public static void main(String[] args) {

  }
}
