package bg.tu_varna.sit.task1;

/**
 * Задача 1
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете сорс файловете в
 * пакет bg.tu_varna.sit.task
 * Да се създаде програма за книжарница.За целта са необходими
 * -Клас Author който се описва симе (firstName), фамилия (lastName) и държава (country).
 * Авторите трябва да могат да се сравняват по две имена и държава, и да се представят текстово във формат <lastName>,
 * <firstName>-Интерфейс Margin с метод calculateMargin(), който изчислява надценката на дадена книга;-Абстрактен клас
 * Book, който се описва сзаглавие (title), автор (author),година на издаване  (publishingYear),  цена  (price)
 * и вид  накориците  (твърди(true)/меки(false))(hasHardCover), катоимплементира  интерфейс  Margin. Поведението
 * на  книгата  включваgetFinalPrice(),който  изчислява  и  връща  крайната  цена  на  книгата(сумата  на  цената  и надценката).
 * Тато текст книгата се представя като <author>: <title>-Клас CrimeNovel, наследяващBook.
 * Надценката се изчислява като 2% от цената ако книгата е с твърди корици и като 1%от цената
 * в случай на меки корици;-Клас PoetryBook, наследяващ Book. Надценката се изчислява като 1%
 * от цената ако книгата е с твърди корици и е издаденаслед 2000 година, и като 5% в останалите
 * случаи;-Клас SciFiNovel, наследяващ Book. Надценката се изчислява като 9% от цената ако книгата
 * е с меки корици и 12% отцената в останалите случаи.Създайте клас Bookstore, който има поле масив от
 * книги (books)и поведение:-calculateTotalBookPrice(), който изчислява и връща цената на всички книги;
 * -calculateAverageBookPrice(), който изчислява и връща средната цена на книгите в книжарницата.
 */
public class Application {

  public static void main(String[] args) {
    // write your code here
  }
}
