#include <iostream>
using namespace std;

/*
Задача 1
Съставете  програма, в която последователно от конзолата се  въвеждат 5 реални числа.
След като се въведе последното число,да се изведе средната им стойност.
*/

int main()
{
	// Деклариране на константа за броят на числата, които ще бъдат въведени
	const short numbersCount = 5;
	// Деклариране на променлива за сумата на всички въведени числа
	double sum = 0;

	// Цикъл, който итерира numbersCount-пъти
	for (short i = 0; i < numbersCount; i++)
	{
		// Деклариране на променлива за числото, което ще бъде въвеедено от потребителя
		double number;
		cin >> number;

		// Прибавяне на прочетенето число към текущата сума
		sum += number;
	}
	// Пресмятане на средната стойност на числата
	double average = sum / numbersCount;

	// Извеждане на резултата
	cout << "Average value: " << average;
}
