#include <iostream>
#define _USE_MATH_DEFINES
#include <math.h>
using namespace std;

/*
* Задача 9
* Съставете  програма,  която  да  изчисли израза y=2*sin(x)*cos^2(x)+1
* при въведена от клавиатурата стойност на ъгъла x.
*/

int main()
{
	/**
	* От документацията на C++ става ясно, че математическите функции sin() и cos()
	* очакват да им се подаде радиан, а не градуси. По тази причина е необходимо да
	* превърнем градусите, въведени от потребителя, в радиани.
	*/
	const double halfC = M_PI / 180;
	// Въвеждане на стойност за ъгъла X в градуси
	double degrees;
	cin >> degrees;
	// Конвертиране на ъгъла в радиани
	double radians = degrees * halfC;

	// Пресмятане стойността на израза y
	double y = 2 * sin(radians) * pow(cos(radians), 2) + 1;

	// Извеждане стойността на y
	cout << y;
}