package bg.tu_varna.sit.task8;

/**
 * Задача 8
 * Подберете подходящи модификатори за достъп в задачата и поставете сорс
 * файловете в пакет bg.tu_varna.sit.task8
 * <p>
 * Да се дефинира интерфейс (Salary) с поле за работните часове на ден (8)
 * и метод calculate
 * <p>
 * Да се реализира клас DrivingLicense (шофьорска книжка) с номер на документа
 * (number) и валидност в месеци (validity).
 * <p>
 * Да се реализира клас Human, който описва човек с три имена (firstname, secondname, thirdname),
 * пол (gender) и възраст (age).
 * Класа Human се наследява от клас Employee с брой часове, които служителят работи на ден
 * (worksHours) и заплата на час (rate). Класа имплементира интерфейса Salary като
 * реализира метод calculate (), който връща заплатата, която служителя получава за един ден.
 * <p>
 * Класа Employee се наследява от клас Driver, който разширява класа с шофьорска
 * книжка (drivingLicense) и брой на курсовете за превозване на пътници, които
 * извършва за един ден (courses). Класа имплементира интерфейса Salary като
 * реализира метод calculate(), която се определя като към резултата от calculate()
 * имплементацията на класа Employee (заплатата му за един ден) се прибавят още 5%,
 * ако за деня шофьорът е извършил повече то 10 курса за превозване на пътници.
 * <p>
 * Клас Employee се наследява от клас Engineer и се определя от брой на машините
 * (number of machines), които е създал за един ден. Класа имплементира интерфейса
 * Salary като реализира метод calculate(), (), която се определя като към резултата от
 * calculate() имплементацията на класа Employee (заплатата му за един ден) се прибавят
 * още по 0.1% от заплатата на час за всяка създадена машина за деня.
 */
class Application {

  public static void main(String[] args) {

  }
}
