#include <iostream>
using namespace std;

/*
* Задача 2
* Съставете алгоритъм за намиране на максималното и минималното число от 3 въведени положителни числа a,b,c.
*/

void main()
{
	// Дефиниране и прочитане на стойности за числата a, b, c
	int a, b, c, max, min;
	cin >> a >> b >> c;

	/*
	* Поредица от проверки, които имат за цел да определят най-голямото число
	* След това се присвоява стойност на променливата max
	*/
	if (a >= b && a >= c) max = a;
	else if (b >= c) max = b;
	else max = c;
	
	// Извеждане стойността на променливата max с нов ред в края
	cout << max << " is the largest number." << endl;

	/*
	* Поредица от проверки, които имат за цел да определят най-малкото число
	* След това се присвоява стойност на променливата min
	*/
	if (a <= b && a <= c) min = a;
	else if (b <= c) min = b;
	else min = c;

	// Извеждане стойността на променливата min
	cout << min << " is the smallest number." << endl;
}
