#include <iostream>
using namespace std;

/*
* Задача 2
* Съставете алгоритъм за намиране на максималното и минималното число от 3 въведени положителни числа a,b,c.
*/

void main()
{
	// Дефиниране и прочитане на стойности за числата a, b, c
	int a, b, c;
	cin >> a >> b >> c;

	/*
	* Поредица от проверки, които имат за цел да определят най-голямото число
	* След това на монитора се извежда низ, който посочва най-голямото число
	*/
	if (a >= b && a >= c) cout << a << " is the largest number.";
	else if (b >= c) cout << b << " is the largest number.";
	else cout << c << " is the largest number.";
	
	// Оставяне на празен ред след като един от низовете в първата поредица от проверки се изведе на монитора
	cout << endl;

	/*
	* Поредица от проверки, които имат за цел да определят най-малкото число
	* След това на монитора се извежда низ, който посочва най-малкото число
	*/
	if (a <= b && a <= c) cout << a << " is the smallest number.";
	else if (b <= c) cout << b << " is the smallest number.";
	else cout << c << " is the smallest number.";
}
