#include <iostream>
#include <string>
using namespace std;

/*
* Задача 9
* Разгледайте следния фрагмент от С/C++ програма.
* Работеща ли е програма, използваща такъв фрагмент? Какъв е резултатът на изхода?
*/

void main()
{
	setlocale(LC_ALL, "BG");
	string s;
	cout << "Въведете низ от символи: " << endl;
	getline(cin, s);
	cout << s << "Край на програмата";

	/*
	* При въведен низ от символи – Varna, резултатут на изхода е: VarnaКрай на програмата
	*/
}