package bg.tu_varna.sit.task6;

/**
 * Задача 6
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете сорс
 * файловете в пакет bg.tu_varna.sit.task6
 * <p>
 * Да се реализира клас Building, който описва сграда с адрес (address) ширина
 * (width), дължина (length) и височина (height). Да се добави абстрактен метод,
 * за изчисление на отопляемия обем (heatedVolume) на сградата и разгъната площ
 * (totalАrea) на сградата.
 * <p>
 * Да се реализира клас House, разширяващ класа Building, който допълнително
 * задава брой етажи и име на собственик. Площта (totalАrea) се изчислява като
 * площ на един етаж умножена по броя на етажите (приема се че всеки етаж има еднаква
 * ширина, дължина и височина). След като се построи къщата, тя може да променя само
 * името на собственика си. Отопляемият обем
 * на къщата се изчислява като площта на един етаж се умножи по височината на къщата
 * и от резултата се приспаднат 25% заради неотопляеми помещения и конструкцията на сградата.
 * <p>
 * Да се реализира клас Block, разширяващ класа Building, който допълнително задава
 * брой входове (entrances), брой апартаменти (apartments) във всеки вход и метод за
 * изчисляване площта на един апартамент (приемаме, че във всеки вход те са с еднакви
 * дължина и ширина а височината им е 2,45). Отопляемият обем да се изчисли като
 * произведение на стандартната височина на един апартамент (2.45), площта на един
 * апартамент, броят апартаменти във вход и броя на входовете, редуциран с 10%
 * заради неотопляеми помещения.
 */
class Application {

  public static void main(String[] args) {

  }
}
