package bg.tu_varna.sit.task4;


/**
 * Задача 4
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете
 * сорс файловете в пакет bg.tu_varna.sit.task4
 * <p>
 * Да се реализира клас Персонаж (Character), който има име (name),
 * живот (life) и абстрактно поведение нанасяне на удар (striking)
 * връща като резултат стойността на удара и отбраняване (defense),
 * приема като стойност нанесени щети.
 * <p>
 * Character се наследява от клас Защитник (Defender) и се разширява
 * със защитно умение (defensiveSkill), броня (armor) и лечителско
 * умение (healingSkill), живота му е 250 при създаване.
 * Имплементира метода (striking), който връща като резултат
 * стойността на удара 10. Метода defense поема като входен параметър
 * нанесени щети, който се вадят от стойността на бронята, ако бронята
 * е нула и има остатък от стойността на нанесените щети те се вадят от
 * живота, след това се активира лечителското умение което носи по 1%
 * възстановяване за всеки 100 единици но не повече от 100% от живота на персонажа.
 * <p>
 * Пример: живот: 250, броня: 150, лечителско умение: 350, нанесени щети: 400
 * Резултат: живот: 8,75, броня: 0, лечителско умение: 350
 * <p>
 * Character се наследява от клас Атакуващ (Attacker) и се разширява с ефективност
 * (efficiency), живота му е 150 при създаване. Имплементира метода (striking),
 * който връща като резултат стойността на ефективността. Метода defense поема
 * като входен параметър нанесени щети, който се вадят от стойността на живота.
 */
class Application {

  public static void main(String[] args) {

  }
}
