#include <iostream>
using namespace std;

/*
* Задача 7
* Създайте програма, която да сравнява две въведени от клавиатурата числа
* и ако първото е по-малко от второто, да размени техните стойности, преди да ги изведе.
*/

int main()
{
	double a, b, c;
	cin >> a >> b;

	if (a < b)
	{
		c = a;
		a = b;
		b = c;
	}

	printf("Num1: %.2f\nNum2: %.2f", a, b);
}