package tuvarna.exercise06;

/**
 * Задача 6
 * <p>
 * Да се реализира клас Building, който описва сграда с ширина, дължина
 * и височина, площ и адрес. Създаването на обекти от Building да се
 * реализира по адрес. Инициализирането на височината и площта да се задава
 * от наследниците. Извличането стойностите на атрибутите да бъде публично.
 * Да се реализира клас House, разширяващ класа Building, който допълнително
 * задава брой етажи и име на собственик. Създаването на обекти от класа
 * House да инициализира с ширина, дължина и височина, и площта на родителския клас.
 * Площта се изчислява като площ на един етаж умножена по броя на етажите.
 * Извличането стойностите на атрибутите да бъде публично.
 * След като се построи къщата, тя може да променя само името на собственика си.
 * Подберете подходящи модификатори за достъп при всеки клас.
 */
public class Main {

  public static void main(String[] args) {

    House house = new House("Varna", 30, 40, 5, 2, "Yavor");
    house.setOwner("Yordan");
    System.out.println(house);
  }
}
