<?php

/* 
 * Задача 4. Да се създаде файл letters.php, който може да се използва за генерация на
 * писма до множество ползватели, за участието им в различни мероприятия.
 * Информацията за хората и мероприятията да е в отделен файл с име data.php.
 * (В самият скрипт letters.php, генериращ поканата, използвайте масиви, условни
 * оператори, цикли, include или require и други изучени вече конструкции.)
 * Резултат:
 * Уважаеми (а), Иван Иванов Имаме удоволствието да ви поканим на открито изложение
 * Бъдете 10 минути преди откриването! С уважение, Деян Иванов!
 */
?>

<?php

$users = array(
  array('name' => 'Иван Иванов', 'event' => 1),
  array('name' => 'Петър Петров', 'event' => 2),
  array('name' => 'Симеон Семов', 'event' => 3),
);

$events = array(
  1 => array(
    'name' => 'Открито изложение',
    'organizer' => 'Деян Иванов',
    'reminder' => 'Бъдете 10 минути преди откриването!'
  ),
  2 => array(
    'name' => 'Бал на випускниците',
    'organizer' => 'Деян Иванов',
    'reminder' => 'Не забравяйте да донесете подарък :-)'
  ),
  3 => array(
    'name' => 'Ден на отворените врати',
    'organizer' => 'Деян Иванов',
    'reminder' => 'Моля, потвърдете Вашето участие по телефона!'
  )
);
?>
