<?php

/* 
 * Задача 4. Да се създаде файл letters.php, който може да се използва за генерация на
 * писма до множество ползватели, за участието им в различни мероприятия.
 * Информацията за хората и мероприятията да е в отделен файл с име data.php.
 * (В самият скрипт letters.php, генериращ поканата, използвайте масиви, условни
 * оператори, цикли, include или require и други изучени вече конструкции.)
 * Резултат:
 * Уважаеми (а), Иван Иванов Имаме удоволствието да ви поканим на открито изложение
 * Бъдете 10 минути преди откриването! С уважение, Деян Иванов!
 */
?>

<?php

require_once 'data.php';

foreach ($users as $user) {
  $name = $user['name'];
  $event = $events[$user['event']];

  $letter = "Уважаеми (а), $name\n\n";
  $letter .= "Имаме удоволствието да ви поканим на $event[name].\n\n";
  $letter .= "$event[reminder]\n\n";
  $letter .= "С уважение, $event[organizer]!";

  echo nl2br($letter) . "<hr>";
}
?>