#include <iostream>
using namespace std;

/*
* Задача 9
* Съставете програма за изчисляване  на  стойността  на  данъка добавена стойност (ДДС) в крайната цена на продукт.
* За целта използвайте формулата: ДДС = (крайна цена*%ДДС)/(100+%ДДС)
* Нека  процентът  на  ДДС (%ДДС)да  бъде  зададен  като  константа  (към настоящия момент е 20). 
*/

int main()
{
	// Дефиниране на константа за процент ДДС
	const double taxPercentage = 20;

	// Дефиниране на променлива за крайната цена
	double price;
	cin >> price;

	// Пресмятане стойността на данъка
	double tax = (price * taxPercentage) / (100 + taxPercentage);

	// Извеждане стойността на ДДС
	cout << tax;
}