#include <iostream>
using namespace std;

/*
* Задача 1
* 
* Създайте програма, която при въведен от клавиатурата пореден ден от седмицата (цяло число между 1 и 7) да извежда следните съобщения:
* - за дните от понеделник до петък:
* “Работен ден”
* “… дни до уикенда”
* - за дните събота и неделя:
* “Почивен ден”
* “… дни до първия работен ден”
* - по подразбиране:
* “Няма такъв ден от седмицата!”
*/

int main()
{
    setlocale(LC_ALL, "BG");
    
    int day;
    cin >> day;

    switch (day)
    {
    case 1:
    case 2:
    case 3:
    case 4:
    case 5:
        cout << "Работен ден" << endl;
        cout << 6 - day <<" дни до уикинда";
        break;
    case 6:
    case 7:
        cout << "Почивен ден" << endl;
        cout << 8 - day << " дни до първия работен ден";
        break;
    default:
        cout << "Няма такъв ден от седмицата!";
        break;
    }
}
