package bg.tu_varna.sit.task7;

/**
 * Задача 7
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете сорс
 * файловете в пакет bg.tu_varna.sit.task7
 * <p>
 * Да се реализира клас Билет (Ticket), който поддържа информация за името
 * на представлението (performanceName), цена (price) и абстрактно поведение
 * за цената на билета (getPrice).
 * <p>
 * Билетът се надгражда от стандартен билет (StandardTicket), важащ за един
 * зрител, допълвайки билета с поле за използван или неизползван (valid).
 * Метода цена (getPrice) връща като резултат стойността на билета, добавена
 * при неговото създаване.
 * <p>
 * Стандартният билет се разширява от билет с намаление (DiscountTicket) за
 * студенти и пенсионери, като добавя поле за името на ползвателя(userName).
 * Метода цена (getPrice) връща като резултат цената на стандартния билет намалена с 50%.
 * Съществува и Групов билет (GroupTicket), който важи максимум за 20 зрители
 * (userCount) и има поле за броя зрители включени в този билет (currentUserCount).
 * <p>
 * При създаването на обект от клас групов билет (GroupTicket) се подава единична
 * цена за един зрител. Класът дефинира метод добавяне на нов зрител (addUser) в групата,
 * като се достигнат максималния брой зрители метода не увеличава текущия брой зрители
 * (currentUserCount). Метода цена (getPrice) връща като резултат цената на стандартния
 * билет умножена по максималния брой зрители, след което се изважда произведението на
 * включените в този билет (currentUserCount), зрители и намалението от 10%.
 */
class Application {

  public static void main(String[] args) {

  }
}
