#include <iostream>
using namespace std;

/*
* Задача 1
* Съставете програма, посредством която да могат да се извършват проверки дали дадена дата
* е подходяща за посещение на медицински кабинет.
*
* Графикът на кабинета е следният:
*	На 10-то, 20-то и 30-то число от месеца се провеждат само детски консултации;
*	На 1 число кабинетът се отчита пред Здравната каса и е затворен за посещения;
*	На 3 и 18 число се извършва профилактика;
*	През всички останали дни кабинетът е отворен за редовни посещения.
* 
* Нека при въвеждане от клавиатурата на съответната дата от месеца, на потребителя да му
* бъде  изведено  релевантно  съобщение:  „Отворен  за  посещения“,  „Ден  за  детска консултация“,
* „Затворен заради работа със ЗК“ или „Профилактика“. 
*/

void main()
{
	setlocale(LC_ALL, "BG");

	int day;
	cin >> day;

	switch (day)
	{
	case 1:
		cout << "Затворен заради работа със ЗК";
		break;
	case 3:
	case 18:
		cout << "Профилактика";
		break;
	case 10:
	case 20:
	case 30:
		cout << "Ден  за  детска консултация";
		break;
	default:
		cout << "Отворен за посещения";
		break;
	}
}