#include <iostream>
using namespace std;

/*
* Задача 3
* Създайте програма, в която при въведена от клавиатурата възраст да се извежда
* дали  потребителят  има  право  да  гласува  на  предстоящите  избори.
* Припомняме, че за целта е необходимо съответното лице да има навършени 18 години.
*/

int main()
{
	int age;
	cin >> age;

	if (age >= 18) cout << "You can vote!";
	else cout << "You can't vote!";
}