package bg.tu_varna.sit.task3;

/**
 * Задача 3
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете сорс
 * файловете в пакет bg.tu_varna.sit.task3
 * <p>
 * Създайте интерфейс Move с метод moving.
 * <p>
 * Реализирайте клас животно (Animal), който описва енергията (energy) на
 * животното до 100% абстрактно поведение за спане (sleep) и ядене (eat),
 * като имплементира интерфейса Move.
 * <p>
 * Реализирайте клас крава (Cow), който имплементира процеса за спане на
 * кравата, като увеличава енергията и с 10% (sleep) и ядене (eat) като
 * увеличава енергията и с 5% и имплементира метода moving с който се намаля енергията с 20%.
 * <p>
 * Реализирайте клас кон (Horse), който имплементира процеса за спане
 * на кравата, като увеличава енергията и с 7% (sleep) и ядене (eat)
 * като увеличава енергията и с 15% и имплементира метода moving с
 * който се намаля енергията с 15%.
 * <p>
 * Реализирайте клас овца (Sheep), който имплементира процеса за
 * спане на кравата, като увеличава енергията и с 5% (sleep) и ядене
 * (eat) като увеличава енергията и с 10% и имплементира метода moving с който се намаля енергията с 25%.
 */
public class Application {

  public static void main(String[] args) {


  }
}
