package tuvarna.exercise05;

import java.util.ArrayList;
import java.util.List;

/**
 * Задача 5
 * <p>
 * Да се реализира клас Град (City), описващ име (name) и пощенски код
 * (postalCode) (положително цяло число). Конструктор с параметри и
 * методи за извличане стойностите на полетата.
 * Да се реализира клас Лична карта (IdentificationCard), описващ номер
 * (number), Година на издаване (year), ЕГН (egn), Град на издаване (city).
 * Конструктор с параметри, методи за извличане стойностите на полетата,
 * освен за полетата Година на издаване, и Град на издаване, за тях да се
 * реализират следните методи за извличане:
 * - Метод издадена от (publishedBy), връща: МВР Името на града на издаване;
 * - Метод валидна до (validUntil), връща: Година на издаване + 10 години;
 * Да се реализира клас Person, описващ лични данни: Първо (firstName),
 * Второ (secondName) и Трето (thirdName) име. Метод iAm извеждащ имената във
 * формат: Трето, Първо Второ, и методи за четене и запис на полетата.
 * Да се реализира клас Аdult, разширяващ класа Person с Лична карта
 * (IdentificationCard), и методи за четене и запис на полетата.
 * Метод Персонална изформация: извеждащ информацията във форма:
 * Трето, Първо Второ
 * Лична карта номер:
 * Издадена от:
 * Подберете подходящи модификатори за достъп при всеки клас.
 */
public class Main {

  public static void main(String[] args) {

    City city = new City("Варна", 9000);
    IdentificationCard identificationCard = new IdentificationCard("495064", 2016, "0000", city);
    Adult adult = new Adult("Явор", "Йоранов", "Чамов", identificationCard);
    System.out.println(adult.getPersonalInformation());
  }
}
