#include <iostream>
#include <math.h>
using namespace std;

/*
* Задача 1
* Въведете 2 числа a и b от клавиатурата. Ако a  е четно число и се дели на 6, изведете квадрата на a на екрана на монитора.
* Ако b е положително число и не се дели на 7, изчислете и изведете следния израз:
* (корен квадратен(b)+квадрат(b))/2, в противен случай -(корен квадратен(b)-квадрат(b))/2.
*/

int main()
{
	// Дефиниране и прочитане на стойности за числата a и b
	int a, b, result;
	cin >> a >> b;

	/*
	* Поредица от проверки, които определят стойността на променливата result
	*/
	if (a % 2 == 0 && a % 6 == 0) result = pow(a, 2);
	else if (b > 0 && b % 7 != 0) result = (sqrt(b) + pow(b, 2)) / 2;
	else result = (sqrt(b) - pow(b, 2)) / 2;

	// Извеждане стойността на result на монитора
	cout << result;
}
