#include <iostream>
using namespace std;

/*
* Задача 3.7
* Какви стойности ще получат променливите c1, c2, c3 при изпълнение на следната програма:
* при въвеждане на следната последователност:
* AB
* CD
* 
*/
void main()
{
    char c1, c2, c3;
    cin.get(c1);
    cin.get(c2);
    cin.get(c3);

    cout << "c1: " << c1 << endl;
    cout << "c2: " << c2 << endl;
    cout << "c3: " << (int)c3 << endl;

    /*
    * Символите ще получат стойности: 'A', 'B' и символ за нов ред (ASCII код - 10).
    * Причината за този изход е, че функцията get се използва за буферно въвеждане.
    * Буферът се запълва със символи докато не се натисне клавишът Enter.
    * Заради това, променливата c3 получава като стойност символ за празен ред.
    */
}
