#include <iostream>
using namespace std;

/*
* Задача 3.6
* Какво ще изведе следващата програма, ако потребителят е въвел последователността Варна10, в отговор на запитването за град?
*/
void main()
{
    char city[6];
    cin.getline(city, 6);
    cout << city << endl;

    /*
    * Програмата ще изведе на монитора низа "Варна".
    * Масивът от символи има дължина 6.
    * Последната клетка от масива се заделя за нулевия (терминиращия) символ.
    * Поради тази причина в масива ще се запазят първите 5 символа от низа "Варна10".
    * ['В', 'а', 'р', 'н', 'а', '\0']
    */
}
