#include <iostream>
using namespace std;

/*
* Задача 14
* Напишете програма, която променя флаговете на cout.setf, така че числата с положителни стойности да се извеждат със знак +.
*/

void main()
{
	// Деклариране на константа, показваща броят на числата, които ще бъдат въведени от потребителя
	const int COUNT = 5;
	// Деклариране на масив, в който ще се запазят въведените от потребителя числа
	int numbers[COUNT];

	cout << "Enter " << COUNT << " numbers: ";
	// Цикъл, чрез който потребителят въвежда 5 числa и тe се запазват в масива
	for (int i = 0; i < COUNT; i++)
	{
		cin >> numbers[i];
	}

	// Обхождане на масива и извеждане на числата с флаг showpos
	for (int i = 0; i < COUNT; i++)
	{
		cout.setf(ios::showpos);
		cout << numbers[i] << endl;
	}
}