#include <iostream>
using namespace std;

/*
* Задача 3.9
* Какво ще изведе следната програма при вход един ред във вида: 0 1 2 3 4 5 6 7 8 9 10 11?
* Заменете в редове 6 и 11 на програмата оператора cin.get(next) с оператор cin >> next.
* Как се променя изхода на програмата при тази замяна?
*/
void main()
{
    char next;
    int count = 0;
    cout << "Enter on one line: '0 1 2 3 4 5 6 7 8 9 10 11'" << endl;
    //cin.get(next);
    cin >> next;
    while (next != '\n')
    {
        if (count % 2 == 0) cout << next;
        count++;
        //cin.get(next);
        cin >> next;
    }

    /*
    * Програмата ще изведе на монитора: 01234567891 1 при използване на get().
    * Ако се използва cin >> next, на монитора ще се изведе 0246811.
    * Получава се безкраен цикъл, защото за ралика от cin.get(next), cin >> next пропуска празните редове (третирира ги като спейсове).
    */
}
