<?php

/* 
 * Задача задомашна работа(реализация на PHP):Да се дефинира абстрактен клас,
 * представящ обекта превозно средство -информацията, която се съхранява  е 
 * годината  на  производство  на  превозното  средство.  Да  се  имплементират 
 * класове, представящи  обектите  кола  и  автобус  (наследявайки  базовия  клас).
 * Класът  за  кола  съхранява параметър, определящ типа на колата -седан, кабрио или комби.
 * Класът за автобус има параметър, съхраняващ информация за максималния брой пътници,
 * които може да събере. И двата класа имат член, извличащ тяхната такса при престой на паркинг.
 * При автомобил таксата се определя по следния начин: година на произвеждане се умножава по 2,
 * в случай че типът на колата е седан или кабрио, или по 3, ако типът е комби.
 * При автобусите: годината на произвеждане се умножава по броя пътници.
 * Да  се  имплементира  клас,  представящ  обекта  паркинг. 
 * Паркингът  има  параметър,  указващ максималния брой места.
 * Да се дефинират методи за добавяне (в края на паркинга) и изтриване (от края на паркинга)
 * на превозно средство. Да се дефинира метод, който изчислява таксата на всички
 * превозни средства, стоящи на паркинга в момента.Да се създаде код за използване на класовете.
 */

require 'Car.php';
require 'Bus.php';
require 'Parking.php';

$car1 = new Car(2010, 'sedan');
$car2 = new Car(2015, 'combi');
$bus1 = new Bus(2018, 50);

$parking = new Parking(5);
$parking->addVehicle($car1);
$parking->addVehicle($car2);
$parking->addVehicle($bus1);

echo "Налични места: " . $parking->getAvailableSpaces();
echo ' ';
echo "Сметка за паркинг: " . $parking->getTotalParkingFee();