package bg.tu_varna.sit.task2;

/**
 * Задача 2
 * <p>
 * Подберете подходящи модификатори за достъп в задачата и поставете
 * сорс файловете в пакет bg.tu_varna.sit.task2
 * Да се създаде програма, описваща агенция за недвижими имоти.
 * За целта са необходими:
 * - Интерфейс Commission с поведение за изчисляване и връщане на
 * комисионната за даден имот, calculateCommission
 * - Абстрактен клас Property, който се описва с площ(area), цена(price)
 * и дали имота се отдава под наем или се продава (isForRent), като
 * имплементира интерфейс Commission.
 * - Клас Apartment, наследник на Property, който се описва с брой стаи
 * (numberOfRooms) и номер на етаж (floor).
 * Комисионната се изчислява като 15% от цената ако апартамента е за
 * отдаване под наем; 10% ако площта му е по-малка от 60 кв.м. и 7% от
 * цената в останалите случаи;
 * - Клас House, наследник на Property, който се описва с брой етажи
 * (numberOfFloors) и наличието на градина или не (hasGarden).
 * Комисионната се изчислява като 8% ако къщата се отдава под наем и има
 * градина; 5% ако къщата е за продажба и площта е по-малка от 100 кв.м. и
 * 3% от цената в останалите случаи;
 * - Клас Office, наследник на Property, който се описва с наличието на
 * паркинг (hasParkingLot) и брой стаи (numberOfRooms).
 * Комисионната се изчислява като 18% от цената ако офисът е за отдаване
 * под наем, 15% ако има паркинг и повече от две стаи, и 11% във всички останали случаи;
 * - Клас Shop, наследник на Property. Комисионната се изчислява като 2%
 * ако магазинът е за отдаване под наем и площта му е по-малка от 50 кв.м.,
 * 1% ако площта му е над 100 кв.м. и 6% във всички останали случаи.
 * Създайте клас RealEstateAgency, който има полета за име (name) и масив от
 * недвижими имоти (properties). Поведението на класа е следното:
 * - calculateTotalExpectedCommission(), изчислява и връща очакваната
 * комисионна от всички предлагани имоти;
 * - getPropertiesForSale(), намира и връща броя недвижими имоти, предлагани
 * от агенцията за продажба.
 */
public class Application {

  public static void main(String[] args) {

  }
}
